In [1]:
import pandas as pd
file_data = pd.read_csv('file_data.csv')
file_data['가격'] = [5000,5000,4000,5000,3000]
file_data

    차림표    가격
0    냉면  5000
1   칼국수  5000
2  잔치국수  4000
3   수제비  5000
4    우동  3000

In [2]:
df1 = file_data.copy()
df2 = pd.DataFrame({
    '차림표':['비빔밥','돈까스','라면','김밥','제육덮밥'],
    '가격':[7000,8000,3000,3000,9000]
})
df2

    차림표    가격
0   비빔밥  7000
1   돈까스  8000
2    라면  3000
3    김밥  3000
4  제육덮밥  9000

In [3]:
# 병합 - 세로방향
dfc1 = pd.concat([df1,df2])
dfc1

    차림표    가격
0    냉면  5000
1   칼국수  5000
2  잔치국수  4000
3   수제비  5000
4    우동  3000
0   비빔밥  7000
1   돈까스  8000
2    라면  3000
3    김밥  3000
4  제육덮밥  9000

In [4]:
# 병합 - 가로방향
dfc2 = pd.concat([df1,df2],axis=1)
dfc2

    차림표    가격   차림표    가격
0    냉면  5000   비빔밥  7000
1   칼국수  5000   돈까스  8000
2  잔치국수  4000    라면  3000
3   수제비  5000    김밥  3000
4    우동  3000  제육덮밥  9000

In [5]:
new_column = ['메뉴1','가격1','메뉴2','가격2']
dfc2.columns = new_column
dfc2

    메뉴1   가격1   메뉴2   가격2
0    냉면  5000   비빔밥  7000
1   칼국수  5000   돈까스  8000
2  잔치국수  4000    라면  3000
3   수제비  5000    김밥  3000
4    우동  3000  제육덮밥  9000

In [6]:
sr1 = dfc2['메뉴1']
sr2 = dfc2['가격2']
print(sr1,'\n')
print(sr2)
type(sr2)

0      냉면
1     칼국수
2    잔치국수
3     수제비
4      우동
Name: 메뉴1, dtype: object

0    7000
1    8000
2    3000
3    3000
4    9000
Name: 가격2, dtype: int64

pandas.core.series.Series

In [7]:
# 시리즈 -> 데이터프레임
df = pd.concat([sr1,sr2],axis=1)
df

    메뉴1   가격2
0    냉면  7000
1   칼국수  8000
2  잔치국수  3000
3   수제비  3000
4    우동  9000

In [8]:
# 열 삭제, inplace=True는 원본에 반영함을 의미 
dfc3 = dfc2.copy()
dfc3.drop(['가격1','가격2'],axis=1,inplace=True)
# dfc3.drop(['가격1','가격2'],axis=1)
dfc3

    메뉴1   메뉴2
0    냉면   비빔밥
1   칼국수   돈까스
2  잔치국수    라면
3   수제비    김밥
4    우동  제육덮밥

In [9]:
# 행 삭제
dfc3.drop([0,1],axis=0,inplace=True)
dfc3

    메뉴1   메뉴2
2  잔치국수    라면
3   수제비    김밥
4    우동  제육덮밥

In [10]:
dfc3 = dfc2.copy()
dfc3

    메뉴1   가격1   메뉴2   가격2
0    냉면  5000   비빔밥  7000
1   칼국수  5000   돈까스  8000
2  잔치국수  4000    라면  3000
3   수제비  5000    김밥  3000
4    우동  3000  제육덮밥  9000

In [11]:
# [과제] 인덱싱을 이용하여 특정 컬럼, 특정 행, 특정 값을 추출

In [12]:
# 조건(하나 또는 복수)에 맞는 데이터 추출 - 불린인덱싱
dfc3.loc[dfc3['가격1']>4500,['메뉴1','가격1']]

   메뉴1   가격1
0   냉면  5000
1  칼국수  5000
3  수제비  5000

In [13]:
# [과제] 행, 열 모두에 조건 지정

In [14]:
# 행 추가
dfc3.loc[5] = ['김치라면', '4000', '만두', '5000']
dfc3

    메뉴1   가격1   메뉴2   가격2
0    냉면  5000   비빔밥  7000
1   칼국수  5000   돈까스  8000
2  잔치국수  4000    라면  3000
3   수제비  5000    김밥  3000
4    우동  3000  제육덮밥  9000
5  김치라면  4000    만두  5000

In [15]:
# 열 추가 
dfc3['메뉴3'] = dfc3.메뉴2
dfc3

    메뉴1   가격1   메뉴2   가격2   메뉴3
0    냉면  5000   비빔밥  7000   비빔밥
1   칼국수  5000   돈까스  8000   돈까스
2  잔치국수  4000    라면  3000    라면
3   수제비  5000    김밥  3000    김밥
4    우동  3000  제육덮밥  9000  제육덮밥
5  김치라면  4000    만두  5000    만두

In [16]:
dfc1

    차림표    가격
0    냉면  5000
1   칼국수  5000
2  잔치국수  4000
3   수제비  5000
4    우동  3000
0   비빔밥  7000
1   돈까스  8000
2    라면  3000
3    김밥  3000
4  제육덮밥  9000

In [17]:
# 인덱시 재정렬
ndf = dfc1.reset_index()
ndf.drop('index',axis=1,inplace=True)
ndf

    차림표    가격
0    냉면  5000
1   칼국수  5000
2  잔치국수  4000
3   수제비  5000
4    우동  3000
5   비빔밥  7000
6   돈까스  8000
7    라면  3000
8    김밥  3000
9  제육덮밥  9000

In [18]:
ndf1 = ndf.copy()
ndf1

    차림표    가격
0    냉면  5000
1   칼국수  5000
2  잔치국수  4000
3   수제비  5000
4    우동  3000
5   비빔밥  7000
6   돈까스  8000
7    라면  3000
8    김밥  3000
9  제육덮밥  9000

In [21]:
# 인덱스 설정
import numpy as np
ndf1.index=np.arange(1,11)
ndf1

     차림표    가격
1     냉면  5000
2    칼국수  5000
3   잔치국수  4000
4    수제비  5000
5     우동  3000
6    비빔밥  7000
7    돈까스  8000
8     라면  3000
9     김밥  3000
10  제육덮밥  9000

In [24]:
import numpy as np
# 인덱스 지정한 데로 설정 : reindex
new_index = np.arange(1,15)
ndf2 = ndf1.reindex(new_index,fill_value=1)#fill value 안넣으면 nan
ndf2

     차림표    가격
1     냉면  5000
2    칼국수  5000
3   잔치국수  4000
4    수제비  5000
5     우동  3000
6    비빔밥  7000
7    돈까스  8000
8     라면  3000
9     김밥  3000
10  제육덮밥  9000
11     1     1
12     1     1
13     1     1
14     1     1

In [26]:
# 내림차순 정렬
ndf2 = ndf1.sort_index(ascending=False)
ndf2

     차림표    가격
10  제육덮밥  9000
9     김밥  3000
8     라면  3000
7    돈까스  8000
6    비빔밥  7000
5     우동  3000
4    수제비  5000
3   잔치국수  4000
2    칼국수  5000
1     냉면  5000

In [27]:
ndf3 = ndf2.sort_index(ascending=True)
ndf3

     차림표    가격
1     냉면  5000
2    칼국수  5000
3   잔치국수  4000
4    수제비  5000
5     우동  3000
6    비빔밥  7000
7    돈까스  8000
8     라면  3000
9     김밥  3000
10  제육덮밥  9000

In [28]:
ndf4 = ndf2.sort_values(by='가격',ascending=False)
ndf4

     차림표    가격
10  제육덮밥  9000
7    돈까스  8000
6    비빔밥  7000
4    수제비  5000
2    칼국수  5000
1     냉면  5000
3   잔치국수  4000
9     김밥  3000
8     라면  3000
5     우동  3000

In [29]:
import numpy as np
import pandas as pd
columns = ['kor','eng','art','math','gym','sci']
index = ['jim','sam','tom','tim','bob']
data = np.random.randint(70,100,size=(5,6))
df = pd.DataFrame(data,index,columns=columns)
df

     kor  eng  art  math  gym  sci
jim   77   70   99    76   94   83
sam   72   89   77    84   73   81
tom   76   81   91    90   94   94
tim   81   85   97    79   81   72
bob   87   89   84    81   72   92

[과제] iloc, loc를 이용해서 아래 요구사항들을 출력하세요
- df의 kor열을 series와 dataframe을 각각 출력
- df에서 sam의 math 점수를 출력(2가지 방법)
- df에서 tom의 eng와 sci 점수를 출력(2가지 방법)
- df에서 jim, tim의 eng, gym 점수를 출력
- df에서 jim, sam의 art,math,gym 점수를 출력

In [ ]:
df['kor']

In [ ]:
df[['kor']]

In [ ]:
df.loc[['sam'],['math']]

In [ ]:
df.iloc[0,1]

In [ ]:
df.loc['sam','math']

In [ ]:
df.loc['tom',['eng','sci']]

In [ ]:
df.loc[['tom'],['eng','sci']]

In [ ]:
df.loc[['jim','tim'],['eng','gym']]

In [ ]:
df.loc[['jim','sam'],['art','math','gym']]

[과제] iloc, loc를 이용해서 아래 요구사항들을 수행하세요
- df에서 sam의 math 점수를 100으로 변경
- df에서 tom의 eng와 math 점수를 100으로 변경
- df에서 jim, tim의 kor, gym 점수를 null값으로 변경
- df에서 math와 gym 점수를 바꾸어 출력

In [ ]:
df.loc['sam','math']=100
df.loc[['sam'],['math']]

In [ ]:
df.loc['tom',['eng','math']]=100
df.loc[['tom'],['eng','math']]

In [ ]:
df.loc[['jim','tim'],['kor','gym']]=np.nan
df.loc[['jim','tim'],['kor','gym']]

In [ ]:
!pip install seaborn

In [ ]:
import seaborn as sns
df = sns.load_dataset('titanic')
df=df.iloc[:500]#인덱싱추출
df.columns #컬럼만추출
df.insert(5,'family',df['sibsp']+df['parch']) #칼럼병합
df= df.drop(['sibsp','parch'],axis=1) #삭제
df=df.replace(['male'],'man')#변경
df=df.sort_values(by='family',ascending=False)#정렬


df

In [ ]:
# [과제] 데이터 추출(인덱싱, 조건), 변경, 삭제, 정렬, 칼럼 병합(sibsp + parch = family) 등을 수행하여 데이터에서 인사이트를 찾아보세요 
import seaborn as sns
df = sns.load_dataset('titanic')
df=df.iloc[:500]#인덱싱추출
df.columns #컬럼만추출
df.insert(5,'family',df['sibsp']+df['parch']) #칼럼병합
df= df.drop(['sibsp','parch'],axis=1) #삭제
df=df.replace(['male'],'man')#변경
df=df.sort_values(by='family',ascending=False)#정렬

In [30]:
import numpy as np
import pandas as pd
data = np.arange(20).reshape(4,5)
df = pd.DataFrame(data,columns=['a','b','c','d','e'])
df.head()

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [31]:
# 삭제
df1 = df.copy()
df1.drop(df1.index[[0,3]])

    a   b   c   d   e
1   5   6   7   8   9
2  10  11  12  13  14

In [32]:
# 특정 조건에 맞는 인덱스 구하기
df1 = df.copy()
idx = df1[df1.a > 10].index
df1.drop(idx)

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [33]:
li = []
for i in range(100):
    li.append('c'+str(i+1))
print(li)

['c1', 'c2', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10', 'c11', 'c12', 'c13', 'c14', 'c15', 'c16', 'c17', 'c18', 'c19', 'c20', 'c21', 'c22', 'c23', 'c24', 'c25', 'c26', 'c27', 'c28', 'c29', 'c30', 'c31', 'c32', 'c33', 'c34', 'c35', 'c36', 'c37', 'c38', 'c39', 'c40', 'c41', 'c42', 'c43', 'c44', 'c45', 'c46', 'c47', 'c48', 'c49', 'c50', 'c51', 'c52', 'c53', 'c54', 'c55', 'c56', 'c57', 'c58', 'c59', 'c60', 'c61', 'c62', 'c63', 'c64', 'c65', 'c66', 'c67', 'c68', 'c69', 'c70', 'c71', 'c72', 'c73', 'c74', 'c75', 'c76', 'c77', 'c78', 'c79', 'c80', 'c81', 'c82', 'c83', 'c84', 'c85', 'c86', 'c87', 'c88', 'c89', 'c90', 'c91', 'c92', 'c93', 'c94', 'c95', 'c96', 'c97', 'c98', 'c99', 'c100']

In [34]:
data = np.random.randn(10000).reshape(100,100)
df = pd.DataFrame(data,columns=li)
df['c2'] = df.c2 * 100
df.iloc[1] = df.iloc[1] * 100
df.head()

,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,...,c91,c92,c93,c94,c95,c96,c97,c98,c99,c100
0,-0.919399,-112.600228,0.409517,0.698985,-0.257103,1.241398,-0.642129,-1.643774,0.750016,-0.351971,...,0.586707,1.170162,2.320726,-1.311221,0.713237,1.369926,-1.784043,0.064881,0.282673,-2.234292
1,69.391338,-2257.630338,-60.742697,-23.153148,150.477193,-4.728520,-94.318275,116.461733,96.622270,-28.798414,...,201.227383,-100.467386,146.183304,139.061059,-38.879945,202.517125,130.911507,50.793463,-68.722230,-99.492901
2,-0.086171,-50.237613,0.490945,-0.744813,0.727411,-2.627051,-0.735884,0.855274,-0.014091,-1.242887,...,1.350442,0.056695,-0.574572,-0.441296,-1.207709,0.272279,-0.491349,-2.087349,-1.329374,0.136226
3,1.539891,-175.861637,-0.246424,-1.204914,-0.283242,0.121755,0.398354,-0.338760,-1.485193,-0.354104,...,-0.163848,0.767038,-1.302422,-0.453707,-0.770406,-0.434180,-0.235864,2.040324,-1.604929,-0.701524
4,0.084722,-266.466700,0.133020,0.908351,1.695201,0.017279,-0.462906,-0.145658,-1.067695,-0.219555,...,-1.154711,0.348958,0.437033,-0.293690,0.787409,0.157073,-1.145093,0.345215,-0.302059,0.267172

In [35]:
df1 = df.copy()
idx = df1[df1.c2 > 10].index
print(idx)

Int64Index([ 5,  7,  8, 11, 16, 18, 20, 21, 24, 27, 28, 29, 30, 35, 36, 39, 42,
            43, 44, 45, 47, 51, 52, 55, 57, 60, 61, 62, 64, 65, 66, 67, 68, 74,
            75, 77, 78, 81, 82, 84, 85, 86, 87, 89, 90, 92, 93, 96, 97, 98],
           dtype='int64')

In [36]:
df1.drop(idx)

,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,...,c91,c92,c93,c94,c95,c96,c97,c98,c99,c100
0,-0.919399,-112.600228,0.409517,0.698985,-0.257103,1.241398,-0.642129,-1.643774,0.750016,-0.351971,...,0.586707,1.170162,2.320726,-1.311221,0.713237,1.369926,-1.784043,0.064881,0.282673,-2.234292
1,69.391338,-2257.630338,-60.742697,-23.153148,150.477193,-4.728520,-94.318275,116.461733,96.622270,-28.798414,...,201.227383,-100.467386,146.183304,139.061059,-38.879945,202.517125,130.911507,50.793463,-68.722230,-99.492901
2,-0.086171,-50.237613,0.490945,-0.744813,0.727411,-2.627051,-0.735884,0.855274,-0.014091,-1.242887,...,1.350442,0.056695,-0.574572,-0.441296,-1.207709,0.272279,-0.491349,-2.087349,-1.329374,0.136226
3,1.539891,-175.861637,-0.246424,-1.204914,-0.283242,0.121755,0.398354,-0.338760,-1.485193,-0.354104,...,-0.163848,0.767038,-1.302422,-0.453707,-0.770406,-0.434180,-0.235864,2.040324,-1.604929,-0.701524
4,0.084722,-266.466700,0.133020,0.908351,1.695201,0.017279,-0.462906,-0.145658,-1.067695,-0.219555,...,-1.154711,0.348958,0.437033,-0.293690,0.787409,0.157073,-1.145093,0.345215,-0.302059,0.267172
6,-0.021515,-231.534276,-0.838575,-0.845506,0.030607,-1.181184,0.607829,0.211606,-0.578811,1.138926,...,-0.467390,0.202202,1.770727,-0.337841,-1.385900,-3.334824,1.946406,0.806638,0.252152,0.937956
9,2.110541,-151.908438,0.230428,-1.495870,-0.324952,0.992166,1.388183,-0.229607,-0.573282,-1.377007,...,0.403117,-1.858664,-1.318309,0.195009,-0.564849,-0.893030,0.041245,-0.362319,0.204755,-1.075783
10,1.352715,-144.136371,1.952098,-0.439333,-0.421805,0.468519,-0.753212,0.317791,-1.796926,-0.803399,...,0.511293,1.303995,0.623267,0.809473,-1.385828,-0.113931,-0.934227,0.031107,-0.220142,1.120665
12,1.797322,-31.290549,-0.809939,-0.064004,0.460126,-1.067223,0.797651,-0.749148,-0.389974,0.872954,...,-0.364752,-0.254804,1.659919,0.375454,0.067589,-0.856810,0.649299,-1.935350,0.934896,0.909691
13,-0.649958,-7.695408,0.070277,0.731982,-0.710408,-1.654759,-0.112791,2.609213,0.336597,0.355042,...,0.585850,-2.371495,-0.471005,-1.936442,-0.499973,-0.170922,-2.688693,-0.607872,-0.171493,1.835342
14,-1.342045,-48.872043,-0.608012,-0.146002,0.594548,0.006863,-1.294316,0.878967,0.457068,-1.337839,...,0.405484,-1.444294,-0.807931,-0.530909,-0.530783,2.253305,0.583255,-0.797317,-0.140951,-0.114480
15,0.089534,-103.276039,-0.184378,1.385428,1.895413,1.749823,-1.775393,-1.107491,0.950702,1.402022,...,-1.199701,0.609352,0.711207,0.323815,-0.518356,1.210723,2.466074,-0.686500,1.303783,0.458950
17,-0.974393,-161.922372,0.433969,0.151980,1.241287,0.576847,0.078820,-1.059299,-0.889214,-1.426809,...,1.584834,0.029485,0.433814,-0.699997,-0.911118,-0.663685,-0.465087,0.251812,-0.256957,0.030526
19,-1.185778,-60.043609,-1.027120,-0.386414,-0.110965,-0.437249,-0.490263,1.312078,-0.956281,-0.034776,...,0.287956,0.262984,0.051239,-0.767991,0.248807,0.484753,1.575184,0.593566,-0.596070,-1.176306
22,-0.617673,-106.935906,0.132509,-1.275184,-0.450516,0.699003,0.209766,0.833414,0.293710,0.715832,...,-1.096098,-0.991973,-0.200545,-1.053697,0.383658,-0.026466,1.047785,-0.371279,-0.026630,0.775000
23,-0.481876,-116.780086,0.194523,-0.314835,-0.524156,-1.763708,-0.456649,0.699416,0.486845,-0.115681,...,0.018900,1.351711,1.181918,1.938648,-0.215711,-1.342981,1.808516,-1.108185,-1.106365,-0.187636
25,-0.120326,-150.128098,-0.902864,-0.809616,1.053427,-0.104638,1.859697,-0.592858,1.093314,-0.977965,...,1.706358,-0.733818,0.090511,1.350453,-0.371955,0.928509,-0.545247,0.843763,0.100427,-0.442984
26,-1.520668,-209.789958,-0.065059,1.468777,2.015957,0.142268,-0.538833,0.602724,-0.562108,-0.699691,...,-1.353990,0.283854,0.343058,-1.628675,-0.754464,1.457639,-0.011827,-0.175553,2.049583,-0.515258
31,1.084217,-71.985094,-1.370435,0.096737,0.269982,-1.809011,0.460273,1.081261,1.056543,0.496384,...,1.672844,0.580803,-0.502788,0.046242,-0.617809,-0.163224,-1.261051,0.240946,0.398452,-0.657901
32,-1.096515,-57.131960,-0.542540,1.607883,-1.921483,0.569838,0.140225,0.914681,1.055309,0.000313,...,0.285765,1.093231,-0.222939,2.034442,1.210549,-0.033604,0.567238,0.578373,0.743113,1.369594
33,-0.655944,-214.686392,-1.363410,0.997176,-1.293978,-0.256534,0.458850,-0.920166,-0.073342,0.831951,...,-0.293296,-1.788487,-0.177927,0.829871,-2.368764,-0.239854,0.319164,0.856418,2.295670,1.945445
34,0.077315,-65.995388,0.661767,0.354834,0.751057,-1.087410,2.337524,-0.377431,-1.724519,0.098298,...,-0.794941,0.553782,-1.274015,1.180878,-0.330211,-0.443621,0.220970,0.936888,-1.314951,0.073229
37,0.702758,-242.130370,0.720848,1.429186,0.268347,-1.851348,1.235415,-1.228662,2.589742,0.859783,...,-0.482860,-0.908790,-0.345678,-1.501732,-1.361956,-0.512493,0.198062,-0.554154,0.698589,0.879547
38,0.977989,-50.919004,0.550155,-0.541558,1.435250,-0.345537,2.227862,-0.671683,1.897856,0.920342,...,0.869009,-0.560627,-0.998887,1.451332,1.359022,-0.331652,0.839457,1.119963,-0.201901,0.126405
40,-0.925669,-103.927686,1.984272,0.416868,0.156097,0.026688,0.839021,1.434174,-0.687467,-0.015416,...,-0.925634,-0.667952,0.462643,0.170968,2.322360,-0.533602,-0.047511,1.172420,-0.576231,0.099066
41,0.402316,-28.025034,-1.604891,0.585612,0.000256,0.248781,-0.945501,2.764241,0.180391,-0.900092,...,-0.257250,-0.233807,-0.877474,-0.851556,-0.832008,0.240165,0.692772,-0.521142,-0.701418,0.767724
46,-0.047428,-56.443841,0.129149,1.791221,-0.606963,-0.247396,-0.915319,-1.006945,-0.139824,-0.894463,...,-0.554766,-0.682762,0.078400,-1.523455,1.055168,-0.439765,0.570523,0.929899,-0.377921,0.314830
48,2.338594,-109.119607,-1.113081,0.433986,-0.980198,0.652624,-1.471098,-0.654388,0.740246,-0.529810,...,-0.423152,0.705367,-0.647599,-0.348232,-1.750838,1.498540,1.125348,0.907581,-0.411068,0.946886
49,0.709008,-152.102020,1.914681,-2.271620,-0.684973,0.941163,-0.086628,0.970910,-0.944125,-2.596396,...,-0.968843,2.303367,-0.050817,-0.914167,1.190940,-0.009192,1.096740,-1.279651,0.661834,0.321354
50,-0.031169,-91.786997,-0.019834,-1.117647,-0.152209,0.972940,1.104671,0.226115,-1.846221,-0.323849,...,-1.126637,-0.441877,-0.232439,1.238611,-0.775290,-1.578639,0.130174,-0.231161,0.506679,1.110795
53,-0.914718,-13.542191,0.291228,1.143603,0.653913,-0.349109,0.009755,-1.085166,-1.522564,1.613310,...,-0.031650,1.187818,-1.462731,1.461220,-0.282685,0.971586,0.032022,-0.043554,-1.871835,-0.480910
54,-0.717413,-63.828828,-1.220793,0.501258,-0.109122,0.872476,-0.392166,1.502370,0.752173,0.132942,...,0.107254,-1.553710,1.004849,0.515361,-0.596244,0.748376,0.128605,-0.808879,-0.577355,1.361854
56,-0.587502,-133.104841,1.077438,-0.634295,-0.264031,0.293057,1.288769,-2.632711,0.636822,-0.406460,...,-0.620591,1.602704,0.578720,0.111140,1.347071,0.487254,0.123790,-0.330626,0.986117,-0.013180
58,0.746564,-99.143401,0.618157,-0.119114,0.306140,0.358428,-0.601022,-0.571088,-0.359431,-1.122705,...,0.841863,-1.207561,-0.953371,1.168117,-0.515419,-0.111315,1.135176,0.848618,-0.748163,-0.029269
59,0.827583,-131.223841,-0.541827,-2.039178,-1.554153,0.330619,0.145243,-0.414042,0.471248,-1.518243,...,-0.614305,-0.187679,-1.449072,0.915541,0.329323,-1.051098,0.528793,-1.996607,-1.677554,0.711977
63,-1.668280,-122.711906,-0.211742,0.989097,1.313234,1.233578,0.254120,1.969553,-1.512902,1.939456,...,-2.237318,-0.632284,0.938313,-1.051010,1.165308,-0.754648,-0.697961,-0.561302,-0.417375,-2.022995
69,-0.098063,-46.837071,-0.264261,-0.823807,-0.699172,0.282772,0.056249,1.081561,0.037788,0.558870,...,-0.461916,1.415971,-2.049394,0.302572,-0.559466,-0.314447,0.788276,-0.800721,0.596188,-1.635594
70,0.723845,-15.171355,0.133983,0.551353,-0.289737,-0.642236,-0.548303,-0.279597,0.775359,1.675262,...,0.823528,1.512715,0.062604,0.688010,-0.280209,-0.227443,-0.177392,0.082705,-0.571310,0.189566
71,-0.992829,5.717326,-1.367260,0.973099,-1.373205,0.374028,1.278893,1.680817,-0.562318,1.275963,...,-0.438949,0.576668,-0.518076,-0.764677,-0.787228,1.521352,-0.288177,0.021236,0.290324,-0.396655
72,1.400738,-229.255744,0.702535,-0.001892,0.567086,0.176445,0.564867,1.574221,0.042343,0.606863,...,-1.336554,0.842331,-2.191371,-2.044944,-1.871328,1.205981,-0.263064,0.149814,-1.758537,0.121414
73,0.628003,-63.747006,-0.244380,-0.313750,-0.709441,0.166045,-1.099980,0.695979,0.013981,0.501067,...,-0.228477,-1.156019,0.344586,-0.629431,-0.582201,0.034002,0.053651,0.969966,-0.188373,-0.393581
76,-0.452935,-19.564982,2.210688,-0.092207,-0.345317,-0.026287,0.588705,1.647601,1.098667,0.736173,...,-0.362323,-0.396266,0.740256,0.237398,-0.799762,-0.636468,-0.416483,-0.823604,0.514624,-0.897439
79,-0.429524,-59.727144,0.130211,-1.225074,-1.119207,1.068902,-0.608708,1.105100,1.755041,-0.573273,...,-0.404456,0.364161,0.871663,-2.053156,-1.780286,1.738833,0.138943,-0.782826,-0.013780,-0.803348
80,-0.736880,-128.018153,0.212894,1.806617,1.304082,-1.777363,1.833793,-0.906318,0.761999,0.697919,...,0.171572,0.116441,-0.087082,-0.304993,0.385282,0.457849,-0.844445,-0.425854,0.081948,1.906490
83,0.071685,-136.244996,0.817468,1.534238,1.337706,0.355025,1.968973,1.334530,0.584479,-1.659628,...,1.087001,-2.126902,-0.429341,0.543034,-1.389974,-0.510975,-0.755172,-1.731853,0.901870,1.719251
88,0.628017,8.540936,-1.620083,-0.539286,-0.156184,-1.223226,0.163321,0.468200,0.017822,1.050513,...,0.155360,-1.235394,1.710782,0.044963,0.252930,-0.030921,-0.686832,0.142011,-0.343357,0.430492
91,0.902877,-18.885847,-1.342150,0.845077,1.570148,0.047724,0.654453,-1.779110,0.201850,-1.577969,...,0.670778,0.812965,-0.503513,0.441803,0.916152,0.232710,-0.543040,0.549960,-0.394376,0.548708
94,0.948107,-63.010562,0.563552,0.747561,-0.495567,-0.990954,-0.108879,0.156009,1.280131,0.950416,...,0.798008,-0.871505,0.703279,-0.388020,-0.694600,0.492895,0.846141,1.670819,0.565309,-1.704448
95,0.554681,-130.761220,-1.758829,0.933764,-0.872463,0.427731,-1.585625,-0.771010,0.857060,1.293337,...,0.370863,-1.438608,0.322661,0.545751,-0.740694,-0.434182,-0.579546,-0.357714,-0.119129,-0.457796
99,-0.128107,-84.376889,-0.853169,0.461585,0.171927,0.214455,0.440666,0.254865,0.398646,0.551811,...,0.098149,0.984734,-0.510618,-1.412693,-0.106792,1.517615,-0.843392,0.106893,-1.045990,-0.478494

In [37]:
df1 = df.copy()
idx = df1.query('c2 > 10').index
print(idx)

Int64Index([ 5,  7,  8, 11, 16, 18, 20, 21, 24, 27, 28, 29, 30, 35, 36, 39, 42,
            43, 44, 45, 47, 51, 52, 55, 57, 60, 61, 62, 64, 65, 66, 67, 68, 74,
            75, 77, 78, 81, 82, 84, 85, 86, 87, 89, 90, 92, 93, 96, 97, 98],
           dtype='int64')

In [38]:
df1 = df.copy()
cond1 = df1.c2 > 10
cond2 = df1.c3 > 0
cond3 = df.c4 < 0

df2 = df1[cond1 & cond2 & cond3]
df2.shape

(7, 100)

In [39]:
df3 = df1[cond1 | cond2 | cond3]
df3.shape

(87, 100)

In [40]:
df1[cond1][['c1','c2']].head()

          c1          c2
5  -0.677187   44.473279
7   0.208516   79.928875
8   0.231972  129.082607
11 -0.596933   90.374996
16  2.725241   29.781483

In [41]:
import seaborn as sns
df = sns.load_dataset('titanic')
tdf = df.copy()
tdf.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [42]:
# 컬럼이름 변경
tdf.rename(columns={'sex':'gender','fare':'ticket'}, inplace=True)
tdf.head()

,survived,pclass,gender,age,sibsp,parch,ticket,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [43]:
tdf.gender.value_counts()
# tdf.gender.unique()

male      577
female    314
Name: gender, dtype: int64

In [44]:
# 값 변경
df1 = tdf[['gender']].replace(['female','male'],[1,0])
df1.gender.value_counts()

0    577
1    314
Name: gender, dtype: int64

In [ ]:
# 칼럼 대문자 변경
tdf.rename(str.upper, axis='columns',inplace=True)
tdf.head()

In [ ]:
# 칼럼 소문자 변경
tdf.rename(str.lower, axis='columns',inplace=True)
tdf.head()

In [ ]:
# 칼럼 순서 변경
columns_customed = ['pclass','gender','age','survived']
tdf[columns_customed].head()

In [45]:
# NaN 으로 변경
df1 = df.copy()
df1['sex'] = df1.sex.replace('male', np.nan)
df1.sex.value_counts()

female    314
Name: sex, dtype: int64

In [46]:
tdf.head(2)

,survived,pclass,gender,age,sibsp,parch,ticket,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [47]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   gender       891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   ticket       891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [48]:
tdf.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [ ]:
tdf.gender.value_counts()

In [49]:
tdf.who.value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [ ]:
tdf.pclass.value_counts()

In [ ]:
tdf.value_counts('class')

In [50]:
# 결측값 대체 : age 평균값
print(tdf.age.isnull().sum(),'\n')
tdf.age.fillna(tdf.age.mean(),inplace=True)
tdf.age.isnull().sum()

177

0

In [51]:
tdf1 = df.copy()
tdf1.age.replace(np.nan, tdf1.age.mean(), inplace=True)
tdf1.age.isnull().sum()

0

In [52]:
# 결측값 삭제
tdf2 = df.copy()
tdf2.dropna(subset=['age'],inplace=True)
print(len(tdf2),'\n')
tdf2.age.isnull().sum()

714

0

In [53]:
tdf[['age','ticket']].head()

    age   ticket
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [ ]:
# 실수를 정수로 변환하여 출력
tdf[['age','ticket']].astype(int).head()

In [ ]:
tdf1 = tdf[['age','ticket']].astype({'age':'int','ticket':'int'})
tdf1.head()

In [54]:
# age 칼럼의 값 구성 체크
tdf.age.value_counts()

29.699118    177
24.000000     30
22.000000     27
18.000000     26
28.000000     25
            ...
36.500000      1
55.500000      1
0.920000       1
23.500000      1
74.000000      1
Name: age, Length: 89, dtype: int64

In [55]:
# age 칼럼의 고유 구성 요소
tdf.age.unique()

array([22.        , 38.        , 26.        , 35.        , 29.69911765,
       54.        ,  2.        , 27.        , 14.        ,  4.        ,
       58.        , 20.        , 39.        , 55.        , 31.        ,
       34.        , 15.        , 28.        ,  8.        , 19.        ,
       40.        , 66.        , 42.        , 21.        , 18.        ,
        3.        ,  7.        , 49.        , 29.        , 65.        ,
       28.5       ,  5.        , 11.        , 45.        , 17.        ,
       32.        , 16.        , 25.        ,  0.83      , 30.        ,
       33.        , 23.        , 24.        , 46.        , 59.        ,
       71.        , 37.        , 47.        , 14.5       , 70.5       ,
       32.5       , 12.        ,  9.        , 36.5       , 51.        ,
       55.5       , 40.5       , 44.        ,  1.        , 61.        ,
       56.        , 50.        , 36.        , 45.5       , 20.5       ,
       62.        , 41.        , 52.        , 63.        , 23.5       ,
        0.92      , 43.        , 60.        , 10.        , 64.        ,
       13.        , 48.        ,  0.75      , 53.        , 57.        ,
       80.        , 70.        , 24.5       ,  6.        ,  0.67      ,
       30.5       ,  0.42      , 34.5       , 74.        ])

In [56]:
# age 칼럼의 범주화
def get_category(age):
    cat=''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 19: cat = 'Teenager'
    elif age <= 35: cat = 'Yong Adult'
    elif age <= 60: cat = 'Adult'
    else:
        cat = 'Elderly'
    return cat
tdf['age_cat'] = tdf.age.apply(lambda x:get_category(x))
tdf[['age','age_cat']].head()

    age     age_cat
0  22.0  Yong Adult
1  38.0       Adult
2  26.0  Yong Adult
3  35.0  Yong Adult
4  35.0  Yong Adult

In [57]:
# 인코딩
tdf = df.copy()
df1 = tdf[['sex','class']]
df1.head()

      sex  class
0    male  Third
1  female  First
2  female  Third
3  female  First
4    male  Third

In [58]:
df1.value_counts('class')

class
Third     491
First     216
Second    184
dtype: int64

In [59]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\admin\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\admin\anaconda3\lib\site-packages (from scikit-learn) (2.2.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\admin\anaconda3\lib\site-packages (from scikit-learn) (1.20.3)
Requirement already satisfied: scipy>=0.19.1 in c:\users\admin\anaconda3\lib\site-packages (from scikit-learn) (1.7.1)
Requirement already satisfied: joblib>=0.11 in c:\users\admin\anaconda3\lib\site-packages (from scikit-learn) (1.1.0)

In [60]:
import warnings
warnings.filterwarnings('ignore')
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
features = ['sex','class']
for feature in features:
    df1[feature] = le.fit_transform(df1[feature])
df1.head()

   sex  class
0    1      2
1    0      0
2    0      2
3    0      0
4    1      2

In [ ]:
tdf=df.copy()
df1=tdf[['sex','class']]
df1.head()

In [ ]:
from sklearn.preprocessing import OneHotEncoder
items=list(df1.sex)
encoder=LabelEncoder()
encoder.fit(items)
labels=encoder.transform(items)
labels=labels.reshape(-1,1)
oh_encoder=OneHotEncoder()
oh_labels = oh_encoder.fit_transform(labels)
print(oh_labels.toarray(),oh_labels.shape)

In [ ]:
pd.get_dummies(df1)

In [ ]:
from sklearn.datasets import load_boston
import pandas as pd
import numpy as np

boston=load_boston()
boston.keys()

In [ ]:
boston.target

In [ ]:
boston.data

In [ ]:
boston.feature_names

In [ ]:
df=pd.DataFrame(boston.data, columns=[boston.feature_names])
df['target']=boston.target
df

In [ ]:
df=df[['INDUS','RM','PTRATIO','LSTAT','target']]
df

In [ ]:
#스케일링
from sklearn.preprocessing import MinMaxScaler

scaler=MinMaxScaler()
df['RM'] = scaler.fit_transform(df.RM)
df.head()

In [ ]:
scaler=MinMaxScaler()
df['INDUS']=scaler.fit_transform(df.INDUS)
df

In [ ]:
for i in ('INDUS','RM','PTRATIO','LSTAT','target'):
    scaler=MinMaxScaler()
    df[i]=scaler.fit_transform(df[i])
df.head()

In [ ]:
df.corr()

In [ ]:
!pip install matplotlib

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

plt.figure(figsize=(5,5))
sns.heatmap(df.corr(),annot=True)

In [ ]:
sns.distplot(df['target'])

In [ ]:
#로그변환
import numpy as np

df['target']=np.log1p(df.target)
sns.distplot(df.target)

In [ ]:
#로그 변환 환원
df['target']=np.expm1(df.target)

In [ ]:
#csv를 불러와서 minmax정규화 뒤에 qsec의 컬럼이 0.5보다 큰 관측치의 계수
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

df = pd.read_csv("mtcars.csv",index_col=0)
df = pd.DataFrame(df)
scaler=MinMaxScaler()

for i in df.columns:
    df[i]=scaler.fit_transform(df[[i]])

len(df.loc[df['qsec']>0.5])

In [ ]:
#결합
data1=np.arange(1,21).reshape(4,5)
data2=np.arange(11,31).reshape(5,4)
df1=pd.DataFrame(data1,columns=['a','b','c','d','e'])
df2=pd.DataFrame(data2,columns=['d','e','h','i'])
print(df1,'\n')

df2
# print(df1)

In [ ]:
df=pd.concat([df1,df2])
df

In [ ]:
df=pd.concat([df1,df2],axis=1)
df

In [ ]:
#교집합
df1.join(df2,lsuffix='_a',rsuffix='_b')

In [ ]:
#합집합
df1.join(df2,lsuffix='_a',rsuffix='_b',how='outer')

In [ ]:
df1['ind']=[1,2,3,4]
df2['ind']=[1,2,3,4,5]
df2

In [ ]:
pd.merge(df1,df2,on='ind')

#단순 합치기는 concat
#인덱스기준으로 join
#컬럼 기준으로 merge

In [ ]:
arr=np.arange(10)
arr=arr.reshape(2,5)
df=pd.DataFrame(arr,columns=['c0','c1','c2','c3','c4'])
df.to_csv('readcsv.csv')

In [ ]:
df=pd.read_csv('readcsv.csv',index_col=0)
df

In [ ]:
df.to_json('dfjson.json')

In [ ]:
df=pd.read_json('dfjson.json')
df

In [ ]:
df.to_pickle('bin.pkl')

In [ ]:
df=pd.read_pickle('bin.pkl')
df

In [ ]:
import pickle
f=open('test.txt','wb')
data={1:'python',2:'you need'}
pickle.dump(data,f)
f.close()

In [ ]:
f=open('test.txt','rb')
data=pickle.load(f)
print(data)
f.close()

In [ ]:
!pip install openpyxl

In [ ]:
df=pd.read_excel('auto-mpg.xlsx')
df.columns

df

In [ ]:
df=df[['mpg', 'cylinders', 'horsepower', 'weight']]
df.to_excel('auto-mpg1.xlsx',index=False)
df=pd.read_excel('auto-mpg1.xlsx')
df

In [ ]:
s1=pd.Series({'국어':100,'영어':80,'수학':90})
s2=pd.Series({'수학':80,'국어':90,'영어':80})
add=s1+s2
sub=s1-s2
mul=s1*s2
div=s1/s2
df=pd.concat([add,sub,mul,div],axis=1)
df

In [ ]:
s1=pd.Series({'국어':100,'영어':80,'수학':90})
s2=pd.Series({'수학':80,'국어':90,'영어':80})
add=s1+s2
sub=s1-s2
mul=s1*s2
div=s1/s2

df=pd.DataFrame([add,sub,mul,div],index=['덧셈','뺄셈','곱셈','나눗셈'])
df

In [ ]:
lst=list('abcdefg')
lst

In [ ]:
df=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))
df

In [ ]:
df1=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))
df2=pd.DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))

df2.loc[1,'b']=np.nan
df2

In [ ]:
df1+df2

In [ ]:
df1.add(df2)

In [ ]:
df2.add(df1)

In [ ]:
df1.add(df2,fill_value=0)

In [ ]:
#sub(),mul,div 를 사용하여 df2의 nan을 0으로 대체하여 연산수행
df2.sub(df1,fill_value=0)

In [ ]:
df2.mul(df1,fill_value=0)

In [ ]:
df2.div(df1,fill_value=0)

In [ ]:
df1.div(df2,fill_value=0)

In [ ]:
df1.reindex(columns=df2.columns,fill_value=0)

In [114]:
df=pd.DataFrame(np.arange(12).reshape(4,3),columns=list('bde'),index=['ut','oh','te','or'])
df

    b   d   e
ut  0   1   2
oh  3   4   5
te  6   7   8
or  9  10  11

In [116]:
srs=df.iloc[0]
srs

b    0
d    1
e    2
Name: ut, dtype: int32

In [117]:
df-srs

    b  d  e
ut  0  0  0
oh  3  3  3
te  6  6  6
or  9  9  9